Обработки/Reports/_ОстаткиЦенныхБумагПоРСБУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ОстаткиЦенныхБумагПоРСБУ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ОстаткиЦенныхБумагПоРСБУ/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Остатки ценных бумаг по РСБУ",
		"0.16",
		,
		Истина,
		);
	
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	// Организуем сбор статистики
	ПолноеИмяОтчета = ЭтотОбъект.Метаданные().ПолноеИмя();
	СессияСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессиюКомпоновкиСКД(ЭтотОбъект, ПолноеИмяОтчета);	
	
	СтандартнаяОбработка = Ложь;
	ВнешниеНаборыДанных = ПолучитьВнешниеНаборыДанных();
	
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.Настройки, ДанныеРасшифровки);
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);
	
	// Заполняем настройки печати	
	РаботаСОтчетами.ЗаполнитьНастройкиПечати(ДокументРезультат, ЭтотОбъект.Метаданные().ПолноеИмя());	
	
	// Завершаем сессию сбора статистики
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(ПолноеИмяОтчета, СессияСбораСтатистики); 	
	
КонецПроцедуры

Функция ПолучитьВнешниеНаборыДанных()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииЦенныхБумагОстатки.Организация КАК Организация,
		|	БухПартииЦенныхБумагОстатки.СчетДоверительногоУправления КАК Контрагент,
		|	&НомерДоговора КАК НомерДоговора,
		|	&ВидДоговора КАК ВидДеятельностиНПФ,
		|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	КодыВТорговыхСистемахСрезПоследних.Код КАК ISIN,
		|	БухПартииЦенныхБумагОстатки.Партия.Дата КАК ПартияДата,
		|	БухПартииЦенныхБумагОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	БухПартииЦенныхБумагОстатки.СтоимостьПокупкиОстаток КАК СтоимостьПокупкиОстаток,
		|	БухПартииЦенныхБумагОстатки.ПереоценкаОстаток + БухПартииЦенныхБумагОстатки.ПереоценкаВСтоимостиОстаток КАК ПереоценкаОстаток,
		|	БухПартииЦенныхБумагОстатки.СтоимостьКупонаОстаток КАК УНКДОстаток,
		|	БухПартииЦенныхБумагОстатки.ПереоценкаКупонаОстаток КАК ННКДОстаток,
		|	БухПартииЦенныхБумагОстатки.Партия КАК Партия,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагОстатки.Партия ССЫЛКА Документ.ИсполнениеОбязательствПоСделке
		|				ИЛИ БухПартииЦенныхБумагОстатки.Партия ССЫЛКА Документ.ПоставкаЦенныхБумаг
		|			ТОГДА БухПартииЦенныхБумагОстатки.Партия.Основание
		|		КОГДА БухПартииЦенныхБумагОстатки.Партия ССЫЛКА Документ.Сделка
		|				ИЛИ БухПартииЦенныхБумагОстатки.Партия ССЫЛКА Документ.СделкаРЕПО
		|			ТОГДА БухПартииЦенныхБумагОстатки.Партия
		|	КОНЕЦ КАК Сделка,
		|	БухПартииЦенныхБумагОстатки.Рынок КАК Рынок,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагОстатки.Партия ССЫЛКА Документ.Сделка
		|				ИЛИ БухПартииЦенныхБумагОстатки.Партия ССЫЛКА Документ.СделкаРЕПО
		|			ТОГДА БухПартииЦенныхБумагОстатки.Партия.НомерСделки
		|		КОГДА БухПартииЦенныхБумагОстатки.Партия ССЫЛКА Документ.ИсполнениеОбязательствПоСделке
		|				И (БухПартииЦенныхБумагОстатки.Партия.Основание ССЫЛКА Документ.Сделка
		|					ИЛИ БухПартииЦенныхБумагОстатки.Партия.Основание ССЫЛКА Документ.СделкаРЕПО)
		|			ТОГДА БухПартииЦенныхБумагОстатки.Партия.Основание.НомерСделки
		|	КОНЕЦ КАК НомерСделки
		|ПОМЕСТИТЬ _ОстаткиПартий
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.БухгалтерскийУчет)) КАК БухПартииЦенныхБумагОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(&Период, ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.ISIN)) КАК КодыВТорговыхСистемахСрезПоследних
		|		ПО БухПартииЦенныхБумагОстатки.ЦеннаяБумага = КодыВТорговыхСистемахСрезПоследних.Объект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(РасходыПоТорговойКомиссии.Сделка, РасходыПоБрокерскойКомиссии.Сделка) КАК Сделка,
		|	ЕСТЬNULL(РасходыПоТорговойКомиссии.ЦеннаяБумага, РасходыПоБрокерскойКомиссии.ЦеннаяБумага) КАК ЦеннаяБумага,
		|	РасходыПоТорговойКомиссии.Валюта КАК ВалютаТорговойКомиссии,
		|	РасходыПоТорговойКомиссии.СуммаОборот КАК ТорговаяКомиссия,
		|	РасходыПоБрокерскойКомиссии.Валюта КАК ВалютаКомиссииБрокера,
		|	РасходыПоБрокерскойКомиссии.СуммаОборот КАК КомиссияБрокера
		|ПОМЕСТИТЬ ВТ_КомиссииПоСделке
		|ИЗ
		|	РегистрНакопления.РасходыПоСделке.Обороты(
		|			,
		|			&Период,
		|			Период,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии)
		|				И Сделка В
		|					(ВЫБРАТЬ
		|						_ОстаткиПартий.Сделка КАК Сделка
		|					ИЗ
		|						_ОстаткиПартий КАК _ОстаткиПартий)) КАК РасходыПоТорговойКомиссии
		|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.РасходыПоСделке.Обороты(
		|				,
		|				&Период,
		|				Период,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии)
		|					И Сделка В
		|						(ВЫБРАТЬ
		|							_ОстаткиПартий.Сделка КАК Сделка
		|						ИЗ
		|							_ОстаткиПартий КАК _ОстаткиПартий)) КАК РасходыПоБрокерскойКомиссии
		|		ПО РасходыПоТорговойКомиссии.Организация = РасходыПоБрокерскойКомиссии.Организация
		|			И РасходыПоТорговойКомиссии.СчетДоверительногоУправления = РасходыПоБрокерскойКомиссии.СчетДоверительногоУправления
		|			И РасходыПоТорговойКомиссии.Сделка = РасходыПоБрокерскойКомиссии.Сделка
		|			И РасходыПоТорговойКомиссии.Рынок = РасходыПоБрокерскойКомиссии.Рынок
		|			И РасходыПоТорговойКомиссии.ЦеннаяБумага = РасходыПоБрокерскойКомиссии.ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОстаткиПартий.Организация КАК Организация,
		|	_ОстаткиПартий.Контрагент КАК Контрагент,
		|	_ОстаткиПартий.НомерДоговора КАК НомерДоговора,
		|	_ОстаткиПартий.ВидДеятельностиНПФ КАК ВидДеятельностиНПФ,
		|	_ОстаткиПартий.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ОстаткиПартий.ISIN КАК ISIN,
		|	_ОстаткиПартий.ПартияДата КАК ПартияДата,
		|	_ОстаткиПартий.КоличествоОстаток КАК КоличествоОстаток,
		|	_ОстаткиПартий.СтоимостьПокупкиОстаток КАК СтоимостьПокупкиОстаток,
		|	_ОстаткиПартий.ПереоценкаОстаток КАК ПереоценкаОстаток,
		|	_ОстаткиПартий.УНКДОстаток КАК УНКДОстаток,
		|	_ОстаткиПартий.ННКДОстаток КАК ННКДОстаток,
		|	_ОстаткиПартий.Партия КАК Партия,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(_ОстаткиПартий.Сделка КАК Документ.Сделка) ЕСТЬ NULL
		|			ТОГДА ВЫБОР
		|					КОГДА УсловияСделокРЕПОСрезПоследних.Количество = 0
		|						ТОГДА 0
		|					ИНАЧЕ ВТ_КомиссииПоСделке.КомиссияБрокера / УсловияСделокРЕПОСрезПоследних.Количество
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА УсловияСделокСрезПоследних.Количество = 0
		|					ТОГДА 0
		|				ИНАЧЕ ВТ_КомиссииПоСделке.КомиссияБрокера / УсловияСделокСрезПоследних.Количество
		|			КОНЕЦ
		|	КОНЕЦ КАК КомиссияБрокера,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(_ОстаткиПартий.Сделка КАК Документ.Сделка) ЕСТЬ NULL
		|			ТОГДА ВЫБОР
		|					КОГДА УсловияСделокРЕПОСрезПоследних.Количество = 0
		|						ТОГДА 0
		|					ИНАЧЕ ВТ_КомиссииПоСделке.ТорговаяКомиссия / УсловияСделокРЕПОСрезПоследних.Количество
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА УсловияСделокСрезПоследних.Количество = 0
		|					ТОГДА 0
		|				ИНАЧЕ ВТ_КомиссииПоСделке.ТорговаяКомиссия / УсловияСделокСрезПоследних.Количество
		|			КОНЕЦ
		|	КОНЕЦ КАК ТорговаяКомиссия,
		|	ВТ_КомиссииПоСделке.ВалютаКомиссииБрокера КАК ВалютаКомиссииБрокера,
		|	ВТ_КомиссииПоСделке.ВалютаТорговойКомиссии КАК ВалютаТорговойКомиссии,
		|	_ОстаткиПартий.Рынок КАК Рынок,
		|	_ОстаткиПартий.НомерСделки КАК НомерСделки,
		|	_ОстаткиПартий.Сделка КАК Сделка
		|ПОМЕСТИТЬ _ОстаткиПартийСДопРасходами
		|ИЗ
		|	_ОстаткиПартий КАК _ОстаткиПартий
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделок.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И Сделка В
		|						(ВЫБРАТЬ
		|							_ОстаткиПартий.Сделка
		|						ИЗ
		|							_ОстаткиПартий КАК _ОстаткиПартий
		|						ГДЕ
		|							НЕ ВЫРАЗИТЬ(_ОстаткиПартий.Сделка КАК Документ.Сделка) ЕСТЬ NULL)) КАК УсловияСделокСрезПоследних
		|		ПО _ОстаткиПартий.Сделка = УсловияСделокСрезПоследних.Сделка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И СделкаРЕПО В
		|						(ВЫБРАТЬ
		|							_ОстаткиПартий.Сделка
		|						ИЗ
		|							_ОстаткиПартий КАК _ОстаткиПартий
		|						ГДЕ
		|							НЕ ВЫРАЗИТЬ(_ОстаткиПартий.Сделка КАК Документ.СделкаРЕПО) ЕСТЬ NULL)
		|					И ЧастьСделкиРЕПО = 1) КАК УсловияСделокРЕПОСрезПоследних
		|		ПО _ОстаткиПартий.Сделка = УсловияСделокРЕПОСрезПоследних.СделкаРЕПО
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КомиссииПоСделке КАК ВТ_КомиссииПоСделке
		|		ПО _ОстаткиПартий.Сделка = ВТ_КомиссииПоСделке.Сделка
		|			И _ОстаткиПартий.ЦеннаяБумага = ВТ_КомиссииПоСделке.ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КурсыВалютСрезПоследних.Валюта КАК Валюта,
		|	КурсыВалютСрезПоследних.Курс КАК Курс,
		|	КурсыВалютСрезПоследних.Кратность КАК Кратность
		|ПОМЕСТИТЬ _КурсыВалют
		|ИЗ
		|	РегистрСведений.КурсыВалют.СрезПоследних(
		|			&Период,
		|			Валюта В
		|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|					_ОстаткиПартийСДопРасходами.ВалютаКомиссииБрокера КАК ВалютаКомиссииБрокера
		|				ИЗ
		|					_ОстаткиПартийСДопРасходами КАК _ОстаткиПартийСДопРасходами
		|			
		|				ОБЪЕДИНИТЬ
		|			
		|				ВЫБРАТЬ РАЗЛИЧНЫЕ
		|					_ОстаткиПартийСДопРасходами.ВалютаТорговойКомиссии
		|				ИЗ
		|					_ОстаткиПартийСДопРасходами КАК _ОстаткиПартийСДопРасходами)) КАК КурсыВалютСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОстаткиПартийСДопРасходами.Организация КАК Организация,
		|	_ОстаткиПартийСДопРасходами.Контрагент КАК Контрагент,
		|	_ОстаткиПартийСДопРасходами.НомерДоговора КАК НомерДоговора,
		|	_ОстаткиПартийСДопРасходами.ВидДеятельностиНПФ КАК ВидДеятельностиНПФ,
		|	_ОстаткиПартийСДопРасходами.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(_ОстаткиПартийСДопРасходами.ЦеннаяБумага) = ТИП(Справочник.Акции)
		|			ТОГДА """" + ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(_ОстаткиПартийСДопРасходами.ЦеннаяБумага КАК Справочник.Акции).Эмитент.Наименование) + "", "" + ВЫБОР
		|					КОГДА ВЫРАЗИТЬ(_ОстаткиПартийСДопРасходами.ЦеннаяБумага КАК Справочник.Акции).ГосударственныйРегистрационныйНомер <> """"
		|						ТОГДА ВЫРАЗИТЬ(_ОстаткиПартийСДопРасходами.ЦеннаяБумага КАК Справочник.Акции).ГосударственныйРегистрационныйНомер
		|					ИНАЧЕ ЕСТЬNULL(КодыВТорговыхСистемахСрезПоследнихISIN.Код, КодыВТорговыхСистемахСрезПоследнихКодНаММВБ.Код)
		|				КОНЕЦ + "", "" + ВЫРАЗИТЬ(_ОстаткиПартийСДопРасходами.ЦеннаяБумага КАК Справочник.Акции).ВалютаНоминала.Наименование
		|		КОГДА ТИПЗНАЧЕНИЯ(_ОстаткиПартийСДопРасходами.ЦеннаяБумага) = ТИП(Справочник.Векселя)
		|			ТОГДА """" + ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(_ОстаткиПартийСДопРасходами.ЦеннаяБумага КАК Справочник.Векселя).Эмитент.Наименование) + "", "" + ВЫБОР
		|					КОГДА ВЫРАЗИТЬ(_ОстаткиПартийСДопРасходами.ЦеннаяБумага КАК Справочник.Векселя).Номер <> """"
		|						ТОГДА ВЫРАЗИТЬ(_ОстаткиПартийСДопРасходами.ЦеннаяБумага КАК Справочник.Векселя).Номер
		|					ИНАЧЕ ЕСТЬNULL(КодыВТорговыхСистемахСрезПоследнихISIN.Код, КодыВТорговыхСистемахСрезПоследнихКодНаММВБ.Код)
		|				КОНЕЦ + "", "" + ВЫРАЗИТЬ(_ОстаткиПартийСДопРасходами.ЦеннаяБумага КАК Справочник.Векселя).ВалютаНоминала.Наименование
		|		КОГДА ТИПЗНАЧЕНИЯ(_ОстаткиПартийСДопРасходами.ЦеннаяБумага) = ТИП(Справочник.ДепозитарныеРасписки)
		|			ТОГДА """" + ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(_ОстаткиПартийСДопРасходами.ЦеннаяБумага КАК Справочник.ДепозитарныеРасписки).Эмитент.Наименование) + "", "" + ВЫБОР
		|					КОГДА ВЫРАЗИТЬ(_ОстаткиПартийСДопРасходами.ЦеннаяБумага КАК Справочник.ДепозитарныеРасписки).РегистрационныйНомер <> """"
		|						ТОГДА ВЫРАЗИТЬ(_ОстаткиПартийСДопРасходами.ЦеннаяБумага КАК Справочник.ДепозитарныеРасписки).РегистрационныйНомер
		|					ИНАЧЕ ЕСТЬNULL(КодыВТорговыхСистемахСрезПоследнихISIN.Код, КодыВТорговыхСистемахСрезПоследнихКодНаММВБ.Код)
		|				КОНЕЦ + "", "" + ВЫРАЗИТЬ(_ОстаткиПартийСДопРасходами.ЦеннаяБумага КАК Справочник.ДепозитарныеРасписки).ВалютаНоминала.Наименование
		|		КОГДА ТИПЗНАЧЕНИЯ(_ОстаткиПартийСДопРасходами.ЦеннаяБумага) = ТИП(Справочник.Доли)
		|			ТОГДА """" + ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(_ОстаткиПартийСДопРасходами.ЦеннаяБумага КАК Справочник.Доли).ЮрЛицо.Наименование) + "", "" + ВЫРАЗИТЬ(_ОстаткиПартийСДопРасходами.ЦеннаяБумага КАК Справочник.Доли).ВалютаНоминала.Наименование
		|		КОГДА ТИПЗНАЧЕНИЯ(_ОстаткиПартийСДопРасходами.ЦеннаяБумага) = ТИП(Справочник.Закладные)
		|			ТОГДА """" + ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(_ОстаткиПартийСДопРасходами.ЦеннаяБумага КАК Справочник.Закладные).Банк.ЮрФизЛицо.Наименование) + "", "" + ЕСТЬNULL(КодыВТорговыхСистемахСрезПоследнихISIN.Код, КодыВТорговыхСистемахСрезПоследнихКодНаММВБ.Код)
		|		КОГДА ТИПЗНАЧЕНИЯ(_ОстаткиПартийСДопРасходами.ЦеннаяБумага) = ТИП(Справочник.ИпотечныеСертификатыУчастия)
		|			ТОГДА """" + ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(_ОстаткиПартийСДопРасходами.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).Эмитент.Наименование) + "", "" + ВЫБОР
		|					КОГДА ВЫРАЗИТЬ(_ОстаткиПартийСДопРасходами.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).ГосударственныйРегистрационныйНомер <> """"
		|						ТОГДА ВЫРАЗИТЬ(_ОстаткиПартийСДопРасходами.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).ГосударственныйРегистрационныйНомер
		|					ИНАЧЕ ЕСТЬNULL(КодыВТорговыхСистемахСрезПоследнихISIN.Код, КодыВТорговыхСистемахСрезПоследнихКодНаММВБ.Код)
		|				КОНЕЦ + ВЫРАЗИТЬ(_ОстаткиПартийСДопРасходами.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).ВалютаНоминала.Наименование
		|		КОГДА ТИПЗНАЧЕНИЯ(_ОстаткиПартийСДопРасходами.ЦеннаяБумага) = ТИП(Справочник.Облигации)
		|			ТОГДА """" + ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(_ОстаткиПартийСДопРасходами.ЦеннаяБумага КАК Справочник.Облигации).Эмитент.Наименование) + "", "" + ВЫБОР
		|					КОГДА ВЫРАЗИТЬ(_ОстаткиПартийСДопРасходами.ЦеннаяБумага КАК Справочник.Облигации).ГосударственныйРегистрационныйНомер <> """"
		|						ТОГДА ВЫРАЗИТЬ(_ОстаткиПартийСДопРасходами.ЦеннаяБумага КАК Справочник.Облигации).ГосударственныйРегистрационныйНомер
		|					ИНАЧЕ ЕСТЬNULL(КодыВТорговыхСистемахСрезПоследнихISIN.Код, КодыВТорговыхСистемахСрезПоследнихКодНаММВБ.Код)
		|				КОНЕЦ + "", "" + ВЫРАЗИТЬ(_ОстаткиПартийСДопРасходами.ЦеннаяБумага КАК Справочник.Облигации).ВалютаНоминала.Наименование
		|		КОГДА ТИПЗНАЧЕНИЯ(_ОстаткиПартийСДопРасходами.ЦеннаяБумага) = ТИП(Справочник.Паи)
		|			ТОГДА """" + РеквизитыПИФСрезПоследних.КраткоеНаименованиеФонда + "", "" + ВЫБОР
		|					КОГДА ВЫРАЗИТЬ(_ОстаткиПартийСДопРасходами.ЦеннаяБумага КАК Справочник.Паи).ГосударственныйРегистрационныйНомер <> """"
		|						ТОГДА ВЫРАЗИТЬ(_ОстаткиПартийСДопРасходами.ЦеннаяБумага КАК Справочник.Паи).ГосударственныйРегистрационныйНомер
		|					ИНАЧЕ ЕСТЬNULL(КодыВТорговыхСистемахСрезПоследнихISIN.Код, КодыВТорговыхСистемахСрезПоследнихКодНаММВБ.Код)
		|				КОНЕЦ + "", "" + ВЫРАЗИТЬ(_ОстаткиПартийСДопРасходами.ЦеннаяБумага КАК Справочник.Паи).ВалютаНоминала.Наименование
		|		КОГДА ТИПЗНАЧЕНИЯ(_ОстаткиПартийСДопРасходами.ЦеннаяБумага) = ТИП(Справочник.ПроизводныеФинансовыеИнструменты)
		|			ТОГДА """" + ЕСТЬNULL(КодыВТорговыхСистемахСрезПоследнихISIN.Код, КодыВТорговыхСистемахСрезПоследнихКодНаММВБ.Код)
		|		ИНАЧЕ _ОстаткиПартийСДопРасходами.ЦеннаяБумага.Наименование
		|	КОНЕЦ КАК ЦеннаяБумагаНаименование,
		|	_ОстаткиПартийСДопРасходами.ISIN КАК ISIN,
		|	_ОстаткиПартийСДопРасходами.ПартияДата КАК ПартияДата,
		|	_ОстаткиПартийСДопРасходами.НомерСделки КАК НомерСделки,
		|	_ОстаткиПартийСДопРасходами.КоличествоОстаток КАК КоличествоОстаток,
		|	_ОстаткиПартийСДопРасходами.СтоимостьПокупкиОстаток КАК СтоимостьПокупкиОстаток,
		|	_ОстаткиПартийСДопРасходами.ПереоценкаОстаток КАК ПереоценкаОстаток,
		|	_ОстаткиПартийСДопРасходами.УНКДОстаток КАК УНКДОстаток,
		|	_ОстаткиПартийСДопРасходами.ННКДОстаток КАК ННКДОстаток,
		|	_ОстаткиПартийСДопРасходами.Партия КАК Партия,
		|	_ОстаткиПартийСДопРасходами.КоличествоОстаток * (_ОстаткиПартийСДопРасходами.КомиссияБрокера * _КурсыВалютКомиссииБрокера.Курс / _КурсыВалютКомиссииБрокера.Кратность + _ОстаткиПартийСДопРасходами.ТорговаяКомиссия * _КурсыВалютТорговойКомиссии.Курс / _КурсыВалютТорговойКомиссии.Кратность) КАК ДопРасходыПриПокупкеОстаток,
		|	_ОстаткиПартийСДопРасходами.Рынок КАК Рынок,
		|	НЕОПРЕДЕЛЕНО КАК ВидЦБ,
		|	_ОстаткиПартийСДопРасходами.Сделка КАК Сделка
		|ИЗ
		|	_ОстаткиПартийСДопРасходами КАК _ОстаткиПартийСДопРасходами
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КурсыВалют КАК _КурсыВалютКомиссииБрокера
		|		ПО _ОстаткиПартийСДопРасходами.ВалютаКомиссииБрокера = _КурсыВалютКомиссииБрокера.Валюта
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КурсыВалют КАК _КурсыВалютТорговойКомиссии
		|		ПО _ОстаткиПартийСДопРасходами.ВалютаТорговойКомиссии = _КурсыВалютТорговойКомиссии.Валюта
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&Период,
		|				Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО (ВЫБОР
		|				КОГДА ТИПЗНАЧЕНИЯ(_ОстаткиПартийСДопРасходами.ЦеннаяБумага) = ТИП(Справочник.Акции)
		|					ТОГДА ВЫРАЗИТЬ(_ОстаткиПартийСДопРасходами.ЦеннаяБумага КАК Справочник.Акции).Эмитент.ЮрФизЛицо
		|				КОГДА ТИПЗНАЧЕНИЯ(_ОстаткиПартийСДопРасходами.ЦеннаяБумага) = ТИП(Справочник.Векселя)
		|					ТОГДА ВЫРАЗИТЬ(_ОстаткиПартийСДопРасходами.ЦеннаяБумага КАК Справочник.Векселя).Эмитент.ЮрФизЛицо
		|				КОГДА ТИПЗНАЧЕНИЯ(_ОстаткиПартийСДопРасходами.ЦеннаяБумага) = ТИП(Справочник.ДепозитарныеРасписки)
		|					ТОГДА ВЫРАЗИТЬ(_ОстаткиПартийСДопРасходами.ЦеннаяБумага КАК Справочник.ДепозитарныеРасписки).Эмитент.ЮрФизЛицо
		|				КОГДА ТИПЗНАЧЕНИЯ(_ОстаткиПартийСДопРасходами.ЦеннаяБумага) = ТИП(Справочник.Доли)
		|					ТОГДА ВЫРАЗИТЬ(_ОстаткиПартийСДопРасходами.ЦеннаяБумага КАК Справочник.Доли).ЮрЛицо
		|				КОГДА ТИПЗНАЧЕНИЯ(_ОстаткиПартийСДопРасходами.ЦеннаяБумага) = ТИП(Справочник.ИпотечныеСертификатыУчастия)
		|					ТОГДА ВЫРАЗИТЬ(_ОстаткиПартийСДопРасходами.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).Эмитент.ЮрФизЛицо
		|				КОГДА ТИПЗНАЧЕНИЯ(_ОстаткиПартийСДопРасходами.ЦеннаяБумага) = ТИП(Справочник.Облигации)
		|					ТОГДА ВЫРАЗИТЬ(_ОстаткиПартийСДопРасходами.ЦеннаяБумага КАК Справочник.Облигации).Эмитент.ЮрФизЛицо
		|				КОГДА ТИПЗНАЧЕНИЯ(_ОстаткиПартийСДопРасходами.ЦеннаяБумага) = ТИП(Справочник.Закладные)
		|					ТОГДА ВЫРАЗИТЬ(_ОстаткиПартийСДопРасходами.ЦеннаяБумага КАК Справочник.Закладные).Банк.ЮрФизЛицо
		|			КОНЕЦ = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(&Период, ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВторговыхСистемах.ISIN)) КАК КодыВТорговыхСистемахСрезПоследнихISIN
		|		ПО _ОстаткиПартийСДопРасходами.ЦеннаяБумага = КодыВТорговыхСистемахСрезПоследнихISIN.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&Период, ) КАК РеквизитыПИФСрезПоследних
		|		ПО (ВЫБОР
		|				КОГДА ТИПЗНАЧЕНИЯ(_ОстаткиПартийСДопРасходами.ЦеннаяБумага) = ТИП(Справочник.Паи)
		|					ТОГДА ВЫРАЗИТЬ(_ОстаткиПартийСДопРасходами.ЦеннаяБумага КАК Справочник.Паи).ПаевойИнвестиционныйФонд = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(&Период, ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.КодНаММВБ)) КАК КодыВТорговыхСистемахСрезПоследнихКодНаММВБ
		|		ПО _ОстаткиПартийСДопРасходами.ЦеннаяБумага = КодыВТорговыхСистемахСрезПоследнихКодНаММВБ.Объект";
		
	ПериодОтчета = ?(ЗначениеЗаполнено(ЭтотОбъект.Период), Новый Граница (КонецДня(ЭтотОбъект.Период), ВидГраницы.Включая), '00010101');
	
	Запрос.УстановитьПараметр("Организация",                   ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Период",                        ПериодОтчета);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления",  ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ВидДоговора",				   ЭтотОбъект.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления);
	Запрос.УстановитьПараметр("НомерДоговора",				   ЭтотОбъект.СчетДоверительногоУправления.НомерДоговора);
	
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	
	Для каждого СтрокаРезультат Из ТаблицаРезультат Цикл
	
		СтрокаРезультат.ВидЦБ = ПолучитьВидЦБ(СтрокаРезультат);
	
	КонецЦикла; 
	
	РаботаСОтчетами.КонтрольМультивалютностиРасходовПоСделкам(ЭтотОбъект.СчетДоверительногоУправления, Дата(1,1,1), КонецДня(ЭтотОбъект.Период), ТаблицаРезультат.ВыгрузитьКолонку("Сделка")); 
		
	Возврат Новый Структура("ТаблицаРезультат", ТаблицаРезультат);

КонецФункции // ПолучитьВнешниеНаборыДанных()
 
Функция ПолучитьВидЦБ(СтрокаРезультат)

	Рынок = СтрокаРезультат.Рынок;
	Актив = СтрокаРезультат.ЦеннаяБумага;
	
	Если Рынок = Перечисления.РынкиЦенныхБумаг.Облигации И Актив.Категория = Перечисления.КатегорииОблигаций.Государственная Тогда
		Возврат "РФ";
	ИначеЕсли Рынок = Перечисления.РынкиЦенныхБумаг.Облигации И Актив.Категория = Перечисления.КатегорииОблигаций.Субфедеральная Тогда
		Возврат "Субъектов РФ";
	ИначеЕсли Рынок = Перечисления.РынкиЦенныхБумаг.ДепозитарныеРасписки
		ИЛИ Рынок = Перечисления.РынкиЦенныхБумаг.ИпотечныеСертификатыУчастия Тогда 
		Возврат "";
	Иначе
		Если Рынок = Перечисления.РынкиЦенныхБумаг.Паи Тогда
			УправляющаяКомпания = Справочники.УправляющиеКомпании.ПолучитьУправляющуюКомпаниюПИФДляПаяНаДату(ЭтотОбъект.Период, Актив);
			ЮрФизЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УправляющаяКомпания, "ЮрФизЛицо");
		Иначе
			ЮрФизЛицо = Актив.Эмитент.ЮрФизЛицо;
		КонецЕсли;
		
		Если Справочники.ЮрФизЛица.ПолучитьФункциональнуюРоль(ЮрФизЛицо, "Банки") = Неопределено Тогда
			Возврат "Прочих резидентов";
		Иначе
			Возврат "Кредитных организаций";
		КонецЕсли
	КонецЕсли; 

КонецФункции
